DataProcessors/упЛегальностьИспользованияСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упЛегальностьИспользованияСервиса</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/упТипыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AxelotMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OSM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СитиГИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыМаршрутизаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыМаршрутизаторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AxelotMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Graphhopper</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СитиГИД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМаршрутизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыГеокодеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыГеокодеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AxelotMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Google</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Nominatim</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СитиГИД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Яндекс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/упЛегальностьИспользованияСервиса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запонлим соответствие именами макетов.
//
// Возвращаемое значение:
//   Соответствие   - В соответствии сервису задаем имя макета и сервиса.
//
Функция ПолучитьСоответствиеСервисаЛегальности() Экспорт

	Соответствие = Новый Соответствие;
	
	// Google.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаGoogle","Google");
	Соответствие.Вставить(Перечисления.упТипыКарт.GoogleMaps,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.GoogleMaps,Структура);
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.Google,Структура);
	
	// Яндекс.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаЯндекс","Яндекс");
	Соответствие.Вставить(Перечисления.упТипыКарт.ЯндексКарты,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.ЯндексКарты,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.ЯндексМаршрутизация,Структура);
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.Яндекс,Структура);
	
	// СитиГИД.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаСитиГИД","СитиГИД");
	Соответствие.Вставить(Перечисления.упТипыКарт.СитиГИД,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.СитиГИД,Структура);
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.СитиГИД,Структура);
	
	// OSM.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаOSM","Open Street Map");
	Соответствие.Вставить(Перечисления.упТипыКарт.OSM,Структура);
	
	// Graphhopper.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаGraphhopper","Graphhopper");
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.Graphhopper,Структура);
	
	// Nominatim.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаNominatim","Nominatim");
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.Nominatim,Структура);

	// Dadata.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаDadata","Dadata");
	Соответствие.Вставить(Истина, Структура);

	Возврат Соответствие;
	
КонецФункции // ПолучитьСоответствиеСервисаЛегальности()

#КонецОбласти

#КонецЕсли
